RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_edim_endat.h
/*!
    \file    gd32h77x_78x_edim_endat.h
    \brief   definitions for the EDIM ENDAT

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_78X_EDIM_ENDAT_H
#define GD32H77X_78X_EDIM_ENDAT_H

#include "gd32h77x_78x.h"

/* EnDat definitions */
#define EDIM_ENDAT                          (EDIM_BASE + 0x00000800U)                 /*!< EDIM_ENDAT base address */

/* registers definitions */
#define EDIM_ENDAT_CMD                      REG32((EDIM_ENDAT) + 0x00000000U)         /*!< EnDat command */
#define EDIM_ENDAT_RDATA0                   REG32((EDIM_ENDAT) + 0x00000004U)         /*!< EnDat received data register 0 */
#define EDIM_ENDAT_RDATA1                   REG32((EDIM_ENDAT) + 0x00000008U)         /*!< EnDat received data register 1 */
#define EDIM_ENDAT_RDATA2                   REG32((EDIM_ENDAT) + 0x0000000CU)         /*!< EnDat received data register 2 */
#define EDIM_ENDAT_RDATA3                   REG32((EDIM_ENDAT) + 0x00000010U)         /*!< EnDat received data register 3 */
#define EDIM_ENDAT_CFG0                     REG32((EDIM_ENDAT) + 0x00000014U)         /*!< EnDat configuration register 0 */
#define EDIM_ENDAT_CFG1                     REG32((EDIM_ENDAT) + 0x00000018U)         /*!< EnDat configuration register 1 */
#define EDIM_ENDAT_STAT                     REG32((EDIM_ENDAT) + 0x0000001CU)         /*!< EnDat status register */
#define EDIM_ENDAT_INTEN                    REG32((EDIM_ENDAT) + 0x00000020U)         /*!< EnDat interrupt enable register */
#define EDIM_ENDAT_SWT                      REG32((EDIM_ENDAT) + 0x00000024U)         /*!< EnDat software trigger register */
#define EDIM_ENDAT_FIFODATA                 REG32((EDIM_ENDAT) + 0x00000128U)         /*!< EnDat FIFO data register */

/* bits definitions */
/* EDIM_ENDAT_CMD */
#define EDIM_ENDAT_CMD_CDATA                BITS(0,15)                           /*!< EnDat communication mode code */
#define EDIM_ENDAT_CMD_MEMADDR              BITS(16,23)                          /*!< Memory range selection, address and port address of encoder */
#define EDIM_ENDAT_CMD_CMD                  BITS(24,29)                          /*!< Encoder receive communication data of instruction or parameters */

/* EDIM_ENDAT_RDATA0 */
#define EDIM_ENDAT_RDATA0_RDATAL            BITS(0,31)                           /*!< Received data from encoder, low 32bit part */

/* EDIM_ENDAT_RDATA1 */
#define EDIM_ENDAT_RDATA1_RDATAH            BITS(0,15)                           /*!< Received data from encoder, high 16bit part */
#define EDIM_ENDAT_RDATA1_CRC               BITS(16,20)                          /*!< CRC for Received data from encoder */
#define EDIM_ENDAT_RDATA1_F1                BIT(21)                              /*!< The safety-relevant error bit (F1) in the received data */
#define EDIM_ENDAT_RDATA1_INVF2             BIT(22)                              /*!< The inverse of the safety-relevant error bit (F2) in the received data */
       
/* EDIM_ENDAT_RDATA2 */     
#define EDIM_ENDAT_RDATA2_DATAADD2          BITS(0,15)                           /*!< data from received additional info 2 */
#define EDIM_ENDAT_RDATA2_MRSADD2           BITS(16,23)                          /*!< MRS code from received additional info 2 */
#define EDIM_ENDAT_RDATA2_CRCADD2           BITS(24,28)                          /*!< CRC from received additional info 2 */
   
/* EDIM_ENDAT_RDATA3 */ 
#define EDIM_ENDAT_RDATA3_DATAADD1          BITS(0,15)                           /*!< data from received additional info 1 */
#define EDIM_ENDAT_RDATA3_MRSADD1           BITS(16,23)                          /*!< MRS code from received additional info 1 */
#define EDIM_ENDAT_RDATA3_CRCADD1           BITS(24,28)                          /*!< CRC from received additional info 1 */
       
/* EDIM_ENDAT_CFG0 */     
#define EDIM_ENDAT_CFG0_HWTRGEN             BIT(0)                               /*!< hardware trigger enable */
#define EDIM_ENDAT_CFG0_DCSEL               BIT(1)                               /*!< data update condition selection */
#define EDIM_ENDAT_CFG0_CTNCLK              BIT(2)                               /*!< continuous clock mode */
#define EDIM_ENDAT_CFG0_DFEN                BIT(3)                               /*!< dma enable */
#define EDIM_ENDAT_CFG0_TCLK                BITS(4,7)                            /*!< transmission clock rate for EnDat */
#define EDIM_ENDAT_CFG0_DATALEN             BITS(8,13)                           /*!< EnDat slave data length */
#define EDIM_ENDAT_CFG0_RSTMSEL             BIT(14)                              /*!< status register reset condition selection */
#define EDIM_ENDAT_CFG0_AUTORST             BIT(15)                              /*!< status register automatic reset enable */
#define EDIM_ENDAT_CFG0_PTIME               BITS(16,23)                          /*!< measured cable propagation time */
#define EDIM_ENDAT_CFG0_PDTCEN              BIT(24)                              /*!< cable propagation time compensation enable */
#define EDIM_ENDAT_CFG0_DFEN_MASK           BITS(25,28)                          /*!< DMA fifo enable mask */
#define EDIM_ENDAT_CFG0_DFEN0               BIT(25)                              /*!< auto load RDATA0 to DMA fifo enable */ 
#define EDIM_ENDAT_CFG0_DFEN1               BIT(26)                              /*!< auto load RDATA1 to DMA fifo enable */
#define EDIM_ENDAT_CFG0_DFEN2               BIT(27)                              /*!< auto load RDATA2 to DMA fifo enable */
#define EDIM_ENDAT_CFG0_DFEN3               BIT(28)                              /*!< auto load RDATA3 to DMA fifo enable */
#define EDIM_ENDAT_CFG0_SWRST               BIT(29)                              /*!< EnDat software reset bit */
#define EDIM_ENDAT_CFG0_FIFOFH              BIT(30)                              /*!< EnDat dma fifo flush bit */
       
/* EDIM_ENDAT_CFG1 */     
#define EDIM_ENDAT_CFG1_PERIOD              BITS(0,7)                            /*!< internal timer trigger period */
#define EDIM_ENDAT_CFG1_PERIOD_7            BIT(7)                               /*!< internal timer trigger period bit7 */
#define EDIM_ENDAT_CFG1_TOTH                BITS(8,15)                           /*!< frame transmission timeout threshold */
#define EDIM_ENDAT_CFG1_TOTH_7              BIT(15)                              /*!< frame transmission timeout threshold bit7 */
#define EDIM_ENDAT_CFG1_RCVTIME3            BITS(16,18)                          /*!< Recovery time III */
#define EDIM_ENDAT_CFG1_FLT                 BITS(19,21)                          /*!< digital filter for data input interface from encoder */
#define EDIM_ENDAT_CFG1_HWTRGDELAY          BITS(24,31)                          /*!< hardware trigger delay */
       
/* EDIM_ENDAT_STAT */       
#define EDIM_ENDAT_STAT_RDATAUPIF           BIT(0)                               /*!< EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update interrupt flag */
#define EDIM_ENDAT_STAT_ERR1MIF             BIT(1)                               /*!< error message 1 bit */
#define EDIM_ENDAT_STAT_CRCIF               BIT(2)                               /*!< CRC error for received data */
#define EDIM_ENDAT_STAT_TYPE1IF             BIT(3)                               /*!< type I error interrupt flag */
#define EDIM_ENDAT_STAT_TYPE2IF             BIT(4)                               /*!< type II error interrupt flag */
#define EDIM_ENDAT_STAT_MRSADDRIF           BIT(5)                               /*!< MRS or address error interrupt flag */
#define EDIM_ENDAT_STAT_RDATA2UPIF          BIT(8)                               /*!< EDIM_ENDAT_RDATA2 registers update interrupt flag */
#define EDIM_ENDAT_STAT_RDATA3UPIF          BIT(9)                               /*!< EDIM_ENDAT_RDATA3 registers update interrupt flag */
#define EDIM_ENDAT_STAT_ERR2MIF             BIT(10)                              /*!< error message 1 bit */
#define EDIM_ENDAT_STAT_CRCADD1IF           BIT(11)                              /*!< CRC error for additional info 1 */
#define EDIM_ENDAT_STAT_CRCADD2IF           BIT(12)                              /*!< CRC error for additional info 2 */
#define EDIM_ENDAT_STAT_BUSYMIF             BIT(13)                              /*!< BUSY bit in EnDat protocol */
#define EDIM_ENDAT_STAT_RMMIF               BIT(14)                              /*!< RM bit in EnDat protocol */
#define EDIM_ENDAT_STAT_WRNMIF              BIT(15)                              /*!< WRNM bit in EnDat protocol */
#define EDIM_ENDAT_STAT_SPKIF               BIT(16)                              /*!< spike detection flag */
#define EDIM_ENDAT_STAT_TOIF                BIT(17)                              /*!< frame transmission timeout flag */
#define EDIM_ENDAT_STAT_TYPE3IF             BIT(18)                              /*!< type III error interrupt flag */
#define EDIM_ENDAT_STAT_DTCF                BIT(22)                              /*!< propagation time compensation flag */
#define EDIM_ENDAT_STAT_PTMCF               BIT(23)                              /*!< propagation time measurement complete flag */
#define EDIM_ENDAT_STAT_FIFOOVRIF           BIT(24)                              /*!< dma overrun error flag */
#define EDIM_ENDAT_STAT_FIFOUNRIF           BIT(25)                              /*!< dma underrun error flag */
#define EDIM_ENDAT_STAT_DMATOIF             BIT(26)                              /*!< dma request timeout flag */
#define EDIM_ENDAT_STAT_NEXTRDYF            BIT(30)                              /*!< next transmission ready flag */
#define EDIM_ENDAT_STAT_DATACHKIF           BIT(31)                              /*!< all check have been performed and status is updated */

/* EDIM_ENDAT_INTEN */       
#define EDIM_ENDAT_INTEN_RDATAUPIE          BIT(0)                               /*!< EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update interrupt enable */
#define EDIM_ENDAT_INTEN_ERR1IE             BIT(1)                               /*!< error message 1 interrupt enable */
#define EDIM_ENDAT_INTEN_CRCIE              BIT(2)                               /*!< CRC error for received data interrupt enable */
#define EDIM_ENDAT_INTEN_TYPE1IE            BIT(3)                               /*!< type I error interrupt enable */
#define EDIM_ENDAT_INTEN_TYPE2IE            BIT(4)                               /*!< type II error interrupt enable */
#define EDIM_ENDAT_INTEN_MRSADDRIE          BIT(5)                               /*!< MRS code or address  error interrupt enable*/
#define EDIM_ENDAT_INTEN_RDATA2UPIE         BIT(8)                               /*!< EDIM_ENDAT_RDATA2 registers update interrupt enable */
#define EDIM_ENDAT_INTEN_RDATA3UPIE         BIT(9)                               /*!< EDIM_ENDAT_RDATA3 registers update interrupt enable */
#define EDIM_ENDAT_INTEN_ERR2IE             BIT(10)                              /*!< error message 2 interrupt enable */
#define EDIM_ENDAT_INTEN_CRCADD1IE          BIT(11)                              /*!< CRC error for additional info 1 interrupt enable */
#define EDIM_ENDAT_INTEN_CRCADD2IE          BIT(12)                              /*!< CRC error for additional info 2 interrupt enable */
#define EDIM_ENDAT_INTEN_BUSYIE             BIT(13)                              /*!< BUSY bit in EnDat protocol set interrupt enable */
#define EDIM_ENDAT_INTEN_RMIE               BIT(14)                              /*!< RM bit in EnDat protocol set interrupt enable */
#define EDIM_ENDAT_INTEN_WRNIE              BIT(15)                              /*!< WRN bit in EnDat protocol set interrupt enable */
#define EDIM_ENDAT_INTEN_SPKIE              BIT(16)                              /*!< spike detection interrupt enable enable */
#define EDIM_ENDAT_INTEN_TOIE               BIT(17)                              /*!< frame transmission timeout interrupt enable */
#define EDIM_ENDAT_INTEN_TYPE3IE            BIT(18)                              /*!< type III error interrupt enable */
#define EDIM_ENDAT_INTEN_FIFOOVRIE          BIT(24)                              /*!< dma overrun error interrupt enable */
#define EDIM_ENDAT_INTEN_FIFOUNRIE          BIT(25)                              /*!< dma underrun error interrupt enable */
#define EDIM_ENDAT_INTEN_DMATOIE            BIT(26)                              /*!< dma request timeout interrupt enable */
#define EDIM_ENDAT_INTEN_DATACHKIE          BIT(31)                              /*!< all check have been performed and status is updated interrupt enable */

/* EDIM_ENDAT_SWT */       
#define EDIM_ENDAT_SWT_SWTR                 BIT(0)                               /*!< data transmission software trigger */

/* EDIM_ENDAT_FIFODATA */
#define EDIM_ENDAT_FIFODATA_FIFODATA        BITS(0,31)                           /*!< EDIM_ENDAT FIFO data from EDIM_ENDAT_RDATAx registers */

/* EDIM_ENDAT_STATUPMODE */
#define EDIM_ENDAT_STATUPMODE_BUSYMIFMODE   BIT(0)                               /*!< EDIM_ENDAT BUSYMIF status bit update mode from EDIM_ENDAT_STATUPMODE registers */
#define EDIM_ENDAT_STATUPMODE_RMMIFMODE     BIT(1)                               /*!< EDIM_ENDAT RMMIF status bit update mode from EDIM_ENDAT_STATUPMODE registers */
#define EDIM_ENDAT_STATUPMODE_WRNMIFMODE    BIT(2)                               /*!< EDIM_ENDAT WRNMIF status bit update mode from EDIM_ENDAT_STATUPMODE registers */

/* EDIM_ENDAT interrupt enable or disable */
#define EDIM_ENDAT_INTEN_MASK               ((uint32_t)0x8707FF3FU)
#define EDIM_ENDAT_INT_RDATAUP              EDIM_ENDAT_INTEN_RDATAUPIE           /*!< EDIM_ENDAT_RDATA0 and EDIM_ENDAT_RADTA1 registers update interrupt */
#define EDIM_ENDAT_INT_ERR1                 EDIM_ENDAT_INTEN_ERR1IE              /*!< error message 1 interrupt */
#define EDIM_ENDAT_INT_CRC                  EDIM_ENDAT_INTEN_CRCIE               /*!< CRC error for received data interrupt */
#define EDIM_ENDAT_INT_TYPE1                EDIM_ENDAT_INTEN_TYPE1IE             /*!< type I error interrupt */
#define EDIM_ENDAT_INT_TYPE2                EDIM_ENDAT_INTEN_TYPE2IE             /*!< type II error interrupt */
#define EDIM_ENDAT_INT_MRSADDR              EDIM_ENDAT_INTEN_MRSADDRIE           /*!< MRS code or address  error interrupt enable*/
#define EDIM_ENDAT_INT_RDATA2UP             EDIM_ENDAT_INTEN_RDATA2UPIE          /*!< EDIM_ENDAT_RDATA2 registers update interrupt */
#define EDIM_ENDAT_INT_RDATA3UP             EDIM_ENDAT_INTEN_RDATA3UPIE          /*!< EDIM_ENDAT_RDATA3 registers update interrupt */
#define EDIM_ENDAT_INT_ERR2                 EDIM_ENDAT_INTEN_ERR2IE              /*!< error message 2 interrupt */
#define EDIM_ENDAT_INT_CRCADD1              EDIM_ENDAT_INTEN_CRCADD1IE           /*!< CRC error for additional information 1 interrupt */
#define EDIM_ENDAT_INT_CRCADD2              EDIM_ENDAT_INTEN_CRCADD2IE           /*!< CRC error for additional information 2 interrupt */
#define EDIM_ENDAT_INT_BUSY                 EDIM_ENDAT_INTEN_BUSYIE              /*!< BUSY bit in EnDat protocol set interrupt */
#define EDIM_ENDAT_INT_RM                   EDIM_ENDAT_INTEN_RMIE                /*!< RM bit in EnDat protocol set interrupt */
#define EDIM_ENDAT_INT_WRN                  EDIM_ENDAT_INTEN_WRNIE               /*!< WRN bit in EnDat protocol set interrupt */
#define EDIM_ENDAT_INT_SPIKE                EDIM_ENDAT_INTEN_SPKIE               /*!< spike detection interrupt */
#define EDIM_ENDAT_INT_TO                   EDIM_ENDAT_INTEN_TOIE                /*!< frame transmission timeout interrupt */
#define EDIM_ENDAT_INT_TYPE3                EDIM_ENDAT_INTEN_TYPE3IE             /*!< type III error interrupt */
#define EDIM_ENDAT_INT_FIFOOVR              EDIM_ENDAT_INTEN_FIFOOVRIE           /*!< dma overrun error interrupt */
#define EDIM_ENDAT_INT_FIFOUNR              EDIM_ENDAT_INTEN_FIFOUNRIE           /*!< dma underrun error interrupt */
#define EDIM_ENDAT_INT_DMATO                EDIM_ENDAT_INTEN_DMATOIE             /*!< dma request timeout interrupt */
#define EDIM_ENDAT_INT_DATACHK              EDIM_ENDAT_INTEN_DATACHKIE           /*!< all check have been performed and status is updated interrupt */

/* define the EDIM_ENDAT  bit position and its register index offset */
#define EDIM_ENDAT_REG_VAL(edim_periph, offset)                    (REG32((edim_periph) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define EDIM_ENDAT_BIT_POS(val)                                    ((uint32_t)(val) & 0x0000001FU)
#define EDIM_ENDAT_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                                  | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define EDIM_ENDAT_REG_VAL2(edim_periph, offset)                   (REG32((edim_periph) + ((uint32_t)(offset) >> 22)))
#define EDIM_ENDAT_BIT_POS2(val)                                   (((uint32_t)(val) & 0x001F0000U) >> 16)

