RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_edim_endat.h
#define EDIM_ENDAT_MODE_GET_POS                             ((uint8_t)0x07)        /*!< Encoder to send position values */
#define EDIM_ENDAT_MODE_SEND_POS_ADD_INFO_SELECT_MEM_AREA   ((uint8_t)0x09)        /*!< Encoder to send position values with additional information and selection of memory area or of the additional information  */
#define EDIM_ENDAT_MODE_SELECT_MEM_AREA                     ((uint8_t)0x0E)        /*!< Selection of memory area  */
#define EDIM_ENDAT_MODE_RECEIVE_COMM_CMD                    ((uint8_t)0x12)        /*!< Encoder to receive communication command */
#define EDIM_ENDAT_MODE_SEND_TEST_VALUE                     ((uint8_t)0x15)        /*!< Encoder to send test values  */
#define EDIM_ENDAT_MODE_SEND_POS_ADD_INFO_RECEIVE_PARA      ((uint8_t)0x1B)        /*!< Encoder to send position values with additional information and receive parameters */
#define EDIM_ENDAT_MODE_RECEIVE_PARA                        ((uint8_t)0x1C)        /*!< Encoder to receive parameters */
#define EDIM_ENDAT_MODE_SEND_PARA                           ((uint8_t)0x23)        /*!< Encoder to send parameters  */
#define EDIM_ENDAT_MODE_SEND_POS_ADD_INFO_PARA              ((uint8_t)0x24)        /*!< Encoder to send position values with additional information and send parameters */
#define EDIM_ENDAT_MODE_RECEIVE_RESET                       ((uint8_t)0x2A)        /*!< Encoder to receive reset */
#define EDIM_ENDAT_MODE_SEND_POS_ADD_INFO_RECEIVE_ERR_RESET ((uint8_t)0x2D)        /*!< Encoder to send position values with additional information and receive error reset */
#define EDIM_ENDAT_MODE_RECEIVE_TEST_CMD                    ((uint8_t)0x31)        /*!< Encoder to receive test command  */
#define EDIM_ENDAT_MODE_SEND_POS_ADD_INFO_RECEIVE_TEST_CMD  ((uint8_t)0x36)        /*!< Encoder to send position values with additional information and receive test command */
#define EDIM_ENDAT_MODE_SEND_POS_ADD_INFO                   ((uint8_t)0x38)        /*!< Encoder to send position values with additional information */

/* EnDat transmission clock rate */
#define CFG0_TCLK(regval)                                   (BITS(4, 7) & ((uint32_t)(regval) << 4))
#define EDIM_ENDAT_TCLK_16_67MHz                            CFG0_TCLK(0)                         /*!< EnDat transmission clock 16.67MHz */
#define EDIM_ENDAT_TCLK_8_33MHz                             CFG0_TCLK(6)                         /*!< EnDat transmission clock 8.33MHz */
#define EDIM_ENDAT_TCLK_4_16MHz                             CFG0_TCLK(11)                        /*!< EnDat transmission clock 4.16MHz */
#define EDIM_ENDAT_TCLK_2MHz                                CFG0_TCLK(12)                        /*!< EnDat transmission clock 2MHz */
#define EDIM_ENDAT_TCLK_1MHz                                CFG0_TCLK(13)                        /*!< EnDat transmission clock 1MHz */
#define EDIM_ENDAT_TCLK_200KHz                              CFG0_TCLK(14)                        /*!< EnDat transmission clock 200KHz */
#define EDIM_ENDAT_TCLK_100KHz                              CFG0_TCLK(15)                        /*!< EnDat transmission clock 100KHz */

/* EnDat position data length */
#define CFG0_DWLG(regval)                                   (BITS(8, 13) & ((uint32_t)(regval) << 8))
#define EDIM_ENDAT_DWLG_nBIT(n)                             CFG0_DWLG(n)                         /*!< encoder data length */

/* EnDat reset moment selection */
#define CFG0_RSTMSEL(regval)                                (BIT(14) & ((uint32_t)(regval) << 14))
#define EDIM_ENDAT_RESET_MOMENT_ANY                         CFG0_RSTMSEL(0)                      /*!< The EDIM_ENDAT_STAT register can be reset by software at any time */
#define EDIM_ENDAT_RESET_MOMENT_UPDATE                      CFG0_RSTMSEL(1)                      /*!< The EDIM_ENDAT_STAT register must be reset by software after EDIM_ENDAT_STAT register is fully updated */

/* EnDat internal timer period time step */
#define EDIM_ENDAT_PERIOD_STEP_2us                          ((uint32_t)0x00000000U)              /*!< configure internal timer step length 2us */
#define EDIM_ENDAT_PERIOD_STEP_200us                        EDIM_ENDAT_CFG1_PERIOD_7             /*!< configure internal timer step length 200us */

/* EnDat internal timer period time */
#define CFG1_PERIOD(regval)                                 (BITS(0, 6) & ((uint32_t)(regval) << 0))
#define EDIM_ENDAT_PERIOD_DISABLE                           CFG1_PERIOD(0)                                   /*!< disable internal timer */
#define EDIM_ENDAT_PERIOD_n_2us(n)                          CFG1_PERIOD(n)                                   /*!< configure internal timer trigger period as n * 2us */
#define EDIM_ENDAT_PERIOD_n_200us(n)                        (CFG1_PERIOD(n) | EDIM_ENDAT_CFG1_PERIOD_7)      /*!< configure internal timer trigger period as n * 200us */

/* EnDat continuous mode */
#define EDIM_ENDAT_CONTINUOUS_DISABLE                       ((uint32_t)0x00000000U)              /*!< continuous clock disable */
#define EDIM_ENDAT_CONTINUOUS_ENABLE                        EDIM_ENDAT_CFG0_CTNCLK               /*!< continuous clock enable */

/* EnDat frame transmission timeout threshold step length */
#define EDIM_ENDAT_TOTH_STEP_2us                            ((uint32_t)0x00000000U)              /*!< configure frame transmission timeout threshold step length 2us */
#define EDIM_ENDAT_TOTH_STEP_200us                          EDIM_ENDAT_CFG1_TOTH_7               /*!< configure frame transmission timeout threshold step length 200us */

/* EnDat frame transmission timeout threshold */
#define CFG1_TOTH(regval)                                   (BITS(8, 14) & ((uint32_t)(regval) << 8))
#define EDIM_ENDAT_TOTH_STOP                                CFG1_TOTH(0)                                     /*!< disable timeout detection */
#define EDIM_ENDAT_TOTH_n_2us(n)                            CFG1_TOTH(n)                                     /*!< configure timeout threshold as n * 2us */
#define EDIM_ENDAT_TOTH_n_200us(n)                          (CFG1_TOTH(n) | EDIM_ENDAT_CFG1_TOTH_7)          /*!< configure timeout threshold as n * 200us */

/* EnDat recovery timer III */
#define CFG1_RCVTIME(regval)                                (BITS(16, 18) & ((uint32_t)(regval) << 16))
#define EDIM_ENDAT_RECOVERY_III_1_2_TCLK                    CFG1_RCVTIME(0)                      /*!< recovery time III 1/2 Tclk */
#define EDIM_ENDAT_RECOVERY_III_0_5us                       CFG1_RCVTIME(1)                      /*!< recovery time III 0.5us */
#define EDIM_ENDAT_RECOVERY_III_1us                         CFG1_RCVTIME(2)                      /*!< recovery time III 1us */
#define EDIM_ENDAT_RECOVERY_III_1_5us                       CFG1_RCVTIME(3)                      /*!< recovery time III 1.5us */
#define EDIM_ENDAT_RECOVERY_III_2us                         CFG1_RCVTIME(4)                      /*!< recovery time III 2us */
#define EDIM_ENDAT_RECOVERY_III_4us                         CFG1_RCVTIME(5)                      /*!< recovery time III 4us */
#define EDIM_ENDAT_RECOVERY_III_8us                         CFG1_RCVTIME(6)                      /*!< recovery time III 8us */
#define EDIM_ENDAT_RECOVERY_III_10us                        CFG1_RCVTIME(7)                      /*!< recovery time III 10us */

/* EnDat digital filter */
#define CFG1_FILTER(regval)                                 (BITS(19, 21) & ((uint32_t)(regval) << 19))
#define EDIM_ENDAT_FILTER_DISABLE                           CFG1_FILTER(0)                       /*!< disable digital filter for data input*/
#define EDIM_ENDAT_FILTER_3CYCLE                            CFG1_FILTER(1)                       /*!< digital filter for data input 3 cycles */
#define EDIM_ENDAT_FILTER_4CYCLE                            CFG1_FILTER(2)                       /*!< digital filter for data input 4 cycles */
#define EDIM_ENDAT_FILTER_5CYCLE                            CFG1_FILTER(3)                       /*!< digital filter for data input 5 cycles */
#define EDIM_ENDAT_FILTER_6CYCLE                            CFG1_FILTER(4)                       /*!< digital filter for data input 6 cycles */
#define EDIM_ENDAT_FILTER_10CYCLE                           CFG1_FILTER(5)                       /*!< digital filter for data input 10 cycles */
#define EDIM_ENDAT_FILTER_20CYCLE                           CFG1_FILTER(6)                       /*!< digital filter for data input 20 cycles */
#define EDIM_ENDAT_FILTER_40CYCLE                           CFG1_FILTER(7)                       /*!< digital filter for data input 40 cycles */

