RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_edim_endat.h
/* EnDat hardware trigger */
#define CFG1_HWTRGDLY(regval)                               (BITS(24, 31) & ((uint32_t)(regval) << 24))
#define EDIM_ENDAT_HWTRGDLY_DISABLE                         CFG1_HWTRGDLY(0)                     /*!< disable hardware trigger delay */
#define EDIM_ENDAT_HWTRGDLY_nCYCLE(n)                       CFG1_HWTRGDLY(n)                     /*!< hardware trigger delay n * EnDat cycles */

/* EnDat DMA enable */
#define EDIM_ENDAT_DMA_SEL_RDATA0                           EDIM_ENDAT_CFG0_DFEN0                /*!< select to load RDATA0 into DMA FIFO */
#define EDIM_ENDAT_DMA_SEL_RDATA1                           EDIM_ENDAT_CFG0_DFEN1                /*!< select to load RDATA1 into DMA FIFO */
#define EDIM_ENDAT_DMA_SEL_RDATA2                           EDIM_ENDAT_CFG0_DFEN2                /*!< select to load RDATA2 into DMA FIFO */
#define EDIM_ENDAT_DMA_SEL_RDATA3                           EDIM_ENDAT_CFG0_DFEN3                /*!< select to load RDATA3 into DMA FIFO */

/* Endat status update mode */
#define EDIM_ENDAT_STAT_DYNAMIC                             (uint32_t)(0x00000000U)              /* EDIM_ENDAT status dynamic update mode */
#define EDIM_ENDAT_STAT_STATIC                              (uint32_t)(0x00000001U)              /* EDIM_ENDAT status static update mode */

/* function declarations */
/* EDIM_ENDAT initialization functions */
/* reset EDIM_ENDAT */
void edim_endat_deinit(void);
/* initialize EDIM_ENDAT parameter struct with a default value */
void edim_endat_parameter_struct_para_init(edim_endat_parameter_struct *initpara);
/* initialize EnDat config */
void edim_endat_init(edim_endat_parameter_struct* init_struct);
/* configure EnDat slave data length */
void edim_endat_data_length(uint32_t clk_pulse);
/* enable EnDat auto reset */
void edim_endat_auto_reset_enable(void);
/* disable EnDat auto reset */
void edim_endat_auto_reset_disable(void);
/* enable EnDat continue clock */
void edim_endat_continue_clock_enable(void);
/* disable EnDat continue clock */
void edim_endat_continue_clock_disable(void);
/* enable unconditional data update */
void edim_endat_update_unconditional_data_enable(void);
/* disable unconditional data update */
void edim_endat_update_unconditional_data_disable(void);
/* enable cable propagation compensation for EnDat */
void edim_endat_cable_propagation_compensation_enable(void);
/* disable cable propagation compensation for EnDat */
void edim_endat_cable_propagation_compensation_disable(void);
/* write cable propagation time for EnDat */
void edim_endat_cable_propagation_time_write(uint8_t time);
/* read cable propagation time for EnDat */
uint8_t edim_endat_cable_propagation_time_read(void);
/* configure reset moment for EnDat */
void edim_endat_reset_moment_select(uint32_t moment);

/* EDIM_ENDAT communication functions */
/* configure EnDat command */
void edim_endat_command(uint32_t mode, uint32_t mrs_addr, uint32_t para);
/* start a frame transmit by software */
void edim_endat_data_transmission_software_trigger(void);
/* reset all registers of EnDat by software */
void edim_endat_software_reset(void);
/* configure EnDat hardware trigger */
void edim_endat_hardware_trigger_config(EventStatus newstatus);
/* configure EnDat hardware trigger delay */
void edim_endat_hardware_trigger_delay_config(uint32_t delay);
/* configure EnDat internal timer trigger period */
void edim_endat_internal_timer_trigger_period_config(uint32_t period);
/* enable EnDat DMA */
void edim_endat_dma_enable(void);
/* disable EnDat DMA */
void edim_endat_dma_disable(void);
/* flush EnDat DMA FIFO */
void edim_endat_dma_flush(void);
/* select EnDat data to DMA FIFO */
void edim_endat_dma_select(uint32_t reg_selected);
/* read EnDat slave data with low 32bit */
uint32_t edim_endat_data_low_read(void);
/* read EnDat encoder data */
uint64_t edim_endat_data_read(void);
/* read EnDat CRC bit in the received data */
uint8_t edim_endat_crc_of_data_read(void);
/* read EnDat F1 bit in the received data */
uint8_t edim_endat_f1_of_data_read(void);
/* read EnDat inverse of F2 bit in the received data */
uint8_t edim_endat_inverse_f2_of_data_read(void);
/* read EnDat encoder data from additional information 1 */
uint16_t edim_endat_additional_info_1_data_read(void);
/* read EnDat encoder data from additional information 2 */
uint16_t edim_endat_additional_info_2_data_read(void);
/* initialize EDIM_ENDAT additional information struct with a default value */
void edim_endat_additional_info_struct_para_init(edim_endat_additional_info_struct *initpara);
/* read entire EnDat encoder additional information 1 */
void edim_endat_additional_info_1_read(edim_endat_additional_info_struct* add_info);
/* read entire EnDat encoder additional information 2 */
void edim_endat_additional_info_2_read(edim_endat_additional_info_struct* add_info);

/* EnDat interrupt and flag */
/* enable the EnDat interrupt */
void edim_endat_interrupt_enable(uint32_t interrupt);
/* disable the EnDat interrupt */
void edim_endat_interrupt_disable(uint32_t interrupt);
/* get EnDat flag */
FlagStatus edim_endat_flag_get(uint32_t flag);
/* clear EnDat flag */
void edim_endat_flag_clear(uint32_t flag);
/* get EnDat interrupt flag */
FlagStatus edim_endat_interrupt_flag_get(edim_endat_interrupt_flag_enum int_flag);
/* clear EnDat interrupt flag */
void edim_endat_interrupt_flag_clear(edim_endat_interrupt_flag_enum int_flag);

#endif /* GD32H77X_78X_EDIM_ENDAT_H */
